const taxType = [
  [0, 0],
  [5000, 0.01],
  [25000, 0.02],
  [50000, 0.03],
  [100000, 0.05],
  [250000, 0.1],
  [500000, 0.15],
  [1000000, 0.2],
  [5000000, 0.25],
  [10000000, 0.3],
  [250000000000, 0.3],
];

/**
 * Рассчет суммы налога для богатых, на основе текущего баланса получателя
 */
exports.calcTax = amount => {
  for (let i = 0; i < taxType.length; i++) {
    if (
      (amount >= taxType[i][0] && !taxType[i + 1]) ||
      (amount >= taxType[i][0] && amount < taxType[i + 1][0])
    )
      return taxType[i][1];
  }
};
